package com.javaex.practice;

public class Ex06 {

	public static void main(String[] args) {


		/*
		(1)	변수한개에는 동시에 여러 개의 값을 담을 수 있다.
			-->변수한개에는 한번에 1개만 같은 자료형의 값만 담을 수 있다
		
		(2)	변수는 선언시에 사용한 타입의 값만 저장할 수 있다.
		    -->변수선언시에 사용한 타입의 값만 저장할 수 있다
		       
		(3)	변수는 초기값이 저장되지 않아도 읽을 수 있다.
		    -->초기값이 저장되지 않으면 사용할 수 없다
		
		(4)	모든 자료형의 변수는 동일한 방식으로 저장된다.
		    -->자료형에 따라 변수의 저장방식은 달라진다.
		 
		(5)	double형은 flaot보다 큰 수를 담을 수 있다.
		    -->double형은 8byte, float형은 4byte로 
		       실수형의 경우 큰byte의 자료형이 정확한 값을 사용할 수 있다
		       (정수형은 큰수 또는 작은 값을 사용할 수 있다)
		
		(6)	int, float, char, String은 모두 기본자료형에 속한다.
		    --> String은 기본자료형이 아니고 참조형 자료형이다
		    
		(7)	final로 선언된 변수는 수정이 가능하다.
		    --> final로 선언된 변수를 상수라 부르며
		        한번 초기화된 값은 변경할 수 없다
		        보통 상수로 선언된 상수명은 대문자로 표기하여 구분한다.
		        
		(8)	long형은 항상 L을 붙여서 대입해야한다.
		    --> long형은 int범위를 넘는 값에 대해서만 L기호를 붙여사용한다
		     
		(9)	float형은 항상 F을 분여서 대입해야한다.
			-->	float형은 항상 F를 붙여 사용한다
			
		*/
		
		
	}

}
